results/results_r5_large/results_r5_large_run3/oltp_read_only_t32/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 32 tps: 98.28 qps: 1595.48 (r/w/o: 1395.92/0.00/199.56) lat (ms,95%): 612.21 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 97.60 qps: 1566.34 (r/w/o: 1371.03/0.00/195.30) lat (ms,95%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 97.70 qps: 1561.41 (r/w/o: 1366.11/0.00/195.30) lat (ms,95%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 96.60 qps: 1548.90 (r/w/o: 1355.50/0.00/193.40) lat (ms,95%): 669.89 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 96.70 qps: 1543.01 (r/w/o: 1350.01/0.00/193.00) lat (ms,95%): 682.06 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 98.30 qps: 1573.20 (r/w/o: 1376.30/0.00/196.90) lat (ms,95%): 694.45 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 32 tps: 94.20 qps: 1507.70 (r/w/o: 1319.20/0.00/188.50) lat (ms,95%): 694.45 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 94.90 qps: 1521.10 (r/w/o: 1331.50/0.00/189.60) lat (ms,95%): 694.45 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 32 tps: 95.70 qps: 1524.39 (r/w/o: 1332.89/0.00/191.50) lat (ms,95%): 682.06 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 101.30 qps: 1626.81 (r/w/o: 1424.11/0.00/202.70) lat (ms,95%): 694.45 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 32 tps: 104.00 qps: 1664.60 (r/w/o: 1456.60/0.00/208.00) lat (ms,95%): 590.56 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 32 tps: 101.20 qps: 1614.70 (r/w/o: 1412.50/0.00/202.20) lat (ms,95%): 623.33 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            165158
        write:                           0
        other:                           23594
        total:                           188752
    transactions:                        11797  (98.08 per sec.)
    queries:                             188752 (1569.30 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      98.0816
    time elapsed:                        120.2775s
    total number of events:              11797

Latency (ms):
         min:                                   75.22
         avg:                                  325.94
         max:                                 1020.41
         95th percentile:                      669.89
         sum:                              3845109.41

Threads fairness:
    events (avg/stddev):           368.6562/5.67
    execution time (avg/stddev):   120.1597/0.08